Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དག་འདི་ནས་འོག་གི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཉི་འབུམ་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡང་དག་རྟོག་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: The Tathāgata Prasphulitakusuma­vairocana answered, ‘There is, noble sons, in the downward direction from this buddha realm, beyond two hundred thousand buddha realms, a world realm called Saṃtīraṇa.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་ཞིག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་དང་ཞིང་ཡང་དག་པར་སྟོན་པའི་སྨོན་ལམ་གྱི་ཡུལ་བཀོད་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་དང་། གཟུངས་ཀྱི་སྒོ་བཀོད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འཆད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཏོ།
en: A tathāgata, and so on, up to and including a bhagavat buddha, named Ratnagarbha resides, lives, and remains there, and he has taught the Dharma, giving the Dharma discourse on the array of prayers that demonstrate the range of bodhisattva activity, the range of samādhis, and the array of dhāraṇī entrances, and he prophesies the highest, most complete enlightenment to many tens of millions of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་བཤད་པ་དང་། ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་མང་པོ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་སྨོན་ལམ་བཏབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དང་། འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་བཟུང་བའི་སྨོན་ལམ་དེ་ལྟ་བུ་དག་ཀྱང་བརྗོད་པས་ན།
en: The bodhisattvas there who have been given prophecies of their highest, most complete enlightenment, have prayed to bring many tens of millions of beings to enlightenment, have chosen the qualities of their buddha realms, and have prayed for the kinds of beings who will be the disciples they train. “ ‘

source: གང་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཟིལ་གྱིས་མནན་ཅིང་རྩོད་པའི་དུས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་ཞིང་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཅན་དང་།
en: Among them all, that one bodhisattva endowed with great compassion has outshone the entire assembly, for he will take as his disciples those who are in a buddha realm that has the five degeneracies during the kaliyuga of obscuring kleśas.

source: མཚམས་མེད་པ་བྱེད་ཅིང་མི་དགེ་བའི་རྩ་བའི་བར་དང་འགྲོགས་ལ་སེམས་ཀྱི་རྒྱུད་ཚིག་པའི་འདུལ་བ་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་གཅིག་པུ་རྣམ་པ་ཐམས་ཅད་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Those disciples will have minds that are burning and will have committed the bad actions with immediate results at death, and so on, up to and including possessing bad roots. “ ‘

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་མཆོད་པ་བྱ་བ་སྤངས་ནས་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཕྱི་མ་དེ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བརྩོན་ཞིང་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ་ཐལ་མོ་སྦྱར་ཅིང་འདུག་ནས་དེའི་བསྔགས་པ་ཡང་རྗོད་པར་བྱེད་དོ།
en: That entire assembly, and the world with its devas, humans, asuras, and gandharvas, have turned from the Tathāgata Ratnagarbha and are engaged in making offerings to that one with great compassion. They have bowed down the five points of their bodies, placed their palms together, and praised him.

source: །སེམས་ཅན་ཆེན་པོ་དེ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔ་ན་འདུག་ཅིང་ལུང་བསྟན་པ་ཉན་ཏོ།
en: That mahāsattva has knelt down before the Bhagavat Tathāgata Ratnagarbha to listen to his prophecy.

source: །གང་གི་ཚེ་སེམས་ཅན་ཆེན་པོ་དེས་བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་པར་གྱུར་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེས་འདི་ལྟ་སྟེ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གི་ས་ཆེན་པོ་དག་རྣམ་པ་དྲུག་ཏུ་གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་ཤིང་འགུལ་བ་དང་། མེ་ཏོག་གི་ཆར་དག་ཀྱང་མངོན་པར་རབ་ཏུ་བབ་པར་གྱུར་པ་དེ་ལྟ་བུའི་འཛུམ་པ་མཛད་དོ།
en: When that mahāsattva knelt on his right knee before that bhagavat, that bhagavat smiled and in the worlds in the ten directions numerous as the particles in a buddha realm, the ground shook and a rain of flowers fell.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་རབ་ཏུ་སད་པར་བྱ་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སྤྱོད་པ་ངེས་པར་བསྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གི་ཕྱོགས་ནས་བསྡུ་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པའི་སྤྱོད་པ་འཇིགས་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེས་དེ་ལྟ་བུའི་ཆོ་འཕྲུལ་བསྟན་ཏོ།། །།བམ་པོ་བཅུ་གཉིས་པ།
en: He performed this miracle so as to awaken the bodhisattva mahāsattvas in all those buddha realms, to reveal the activity of the compassionate bodhisattva’s prayer, so that bodhisattva mahāsattvas would come from those buddha realms as numerous as the particles in a buddha realm, and so that the bodhisattva mahāsattvas would be given the Dharma discourse on the fearless conduct that reveals the entrance to samādhi.’ “

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རང་གི་ས་རྣམ་པར་འབྱེད་པས་ཡུལ་ཡང་དག་པར་འཁྲུགས་པ་དང་། གཟུངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་དགའ་བ་རྣམ་པར་འཁྲུགས་པ་ཞེས་བྱ་བའི་རིགས་ཀྱི་བུ་དེ་གཉིས་ཀྱིས་ཡོངས་སུ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གིས་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་དུ་ཉོན་མོངས་པ་དང་འཁྲུག་པ་བདོ་ཞིང་རྩོད་པའི་དུས་ལ་བབ་པའི་དུས་ཡོངས་སུ་བཟུང་ཞིང་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། མི་དགེ་བའི་རྩ་བའི་བར་དང་འགྲོགས་པར་གྱུར་ཅིང་། སེམས་ཀྱི་རྒྱུད་ཚིག་པའི་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་བཟུང་བར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ནས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་།
en: Noble son, those two bodhisattva mahāsattvas, Svaviṣayasaṃkopitaviṣaya and Dhāraṇī­saṃpraharṣaṇa­vikopita, asked the Tathāgata Prasphulitakusuma­vairocana, ‘Bhadanta Bhagavat, this bodhisattva mahāsattva, who has great compassion, who has chosen a world with the five degeneracies in the time of the kaliyuga in which kleśas and conflicts are strong, and who has chosen as his disciples those whose minds are burning, who have committed the bad actions with immediate results at death, and so on, up to and including those who possess bad roots, how long has it been since he developed the aspiration for enlightenment?

source: ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ཏུ་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་ལགས།
en: How long has he been practicing the conduct of enlightenment?’ “ ‘

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ནི་གདོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Noble sons,’ said the Tathāgata Prasphulitakusuma­vairocana, ‘that bodhisattva mahāsattva who has great compassion has now, for the first time, developed the aspiration for the highest, most complete enlightenment.

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དེ་ལ་བལྟ་བ་དང་།
en: Noble sons, you should go to the buddha realm Saṃtīraṇa in order to see, pay homage to, and honor the tathāgata arhat samyaksam­buddha Ratnagarbha, and to listen to him give the Dharma discourse on the fearless conduct that reveals the entrance to samādhi.

source: ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པའི་སྤྱོད་པ་འཇིགས་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་མཉན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་ཡང་དག་རྟོག་དེར་དོང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ལ་ངའི་ཚིག་གིས་དྲིས་ལ་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་དྲི་བར་མཛད་དེ། མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་ཀྱང་བསྐུར་ཞིང་ལེགས་སོ་ཞེས་བྱ་བ་ཡང་བྱིན་ཏེ།
en: You should address the bodhisattva mahāsattva Mahākāruṇika in this way: “The Tathāgata Prasphulitakusuma­vairocana addresses you, worthy being, and he has sent you these flowers, which are as stainless as the moon’s radiance, and he congratulates you.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་དེ་ལྟར་སེམས་དང་པོ་བསྐྱེད་པ་ནས་སྙིང་རྗེ་ཆེན་པོ་བརྗོད་པས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་སྒྲས་གང་བར་གྱུར་ཅིང་། སྙིང་རྗེ་ཆེན་པོའི་སྒྲ་ཡང་རབ་ཏུ་ཐོབ་པ་ཡིན་ནོ།
en: Worthy being, in this way you have developed for the first time the aspiration for enlightenment and have spoken with great compassion in such a way that the buddha realms in the ten directions as numerous as the number of particles in a buddha realm were filled with your words, and you have acquired the name Mahākāruṇika. “ ‘

source: །སྐྱེས་བུ་དམ་པ་དེའི་ཕྱིར་ན་ཁྱོད་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཕྱི་མ་རྣམས་ལ་ཡང་སྙིང་རྗེ་ཆེན་པོ་བརྗོད་པའི་སྨོན་ལམ་གྱིས་ཡང་དང་ཡང་དུ་བྱམས་པའི་རྒྱལ་མཚན་ལེགས་པར་འཛུགས་པར་འགྱུར་ཏེ།
en: Worthy being, through your compassionate words, you will excellently raise again and again the victory banner of kindness toward future bodhisattva mahāsattvas. “ ‘

source: སྐྱེས་བུ་དམ་པ་དེའི་ཕྱིར་མ་འོངས་པའི་བསྐལ་པ་གྲངས་མེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་ཡང་དང་ཡང་དུ་ཁྱོད་ཀྱི་སྙན་པ་དང་། གྲགས་པའི་སྒྲས་ཀུན་ཏུ་གང་བར་འགྱུར་རོ།
en: Worthy being, throughout countless future eons as numerous as the particles in a buddha realm, word of your fame and renown will fill the buddha realms in the ten directions as numerous as the particles in a buddha realm. “ ‘

source: །སྐྱེས་བུ་དམ་པ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས།
en: Good man, you have made many countless hundreds of thousands of millions of trillions of beings aspire to the highest, most complete enlightenment and made them enter into and be established in that aspiration.

source: བཅོམ་ལྡན་འདས་ལ་ཕུལ་བ་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་པར་གྱུར་ཏེ་དེ་ལ་ཁ་ཅིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སྨོན་ལམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཡོངས་སུ་བཟུང་བ་དག་དང་། འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱང་སྙིང་རྗེའི་འོད་ཟེར་དག་གིས་ཀུན་ཏུ་བཀབ་པར་གྱུར་ཏོ།
en: You have brought them before the Bhagavat and established them in irreversibility from the highest enlightenment. Some of them, through a prayer in the presence of the Bhagavat, have chosen the array of qualities of a buddha realm, and will bathe those beings whom they will train with the light rays of their compassion.

source: །གང་དག་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས་ལུང་བསྟན་པ་མ་ཐོབ་པ་དེ་དག་ཀྱང་ཕྱིས་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་ཏེ།
en: Those whom you have directed toward enlightenment and who have not received a prophecy will in the future receive a prophecy.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱིས་བསྐལ་པ་གྲངས་མེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བར་དག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་པོ་གཞན་དག་ཏུ་སངས་རྒྱས་ཉིད་ཐོབ་ཅིང་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་ཁྱོད་ཉིད་ལས་བརྩམས་ཤིང་བསྔགས་པ་རྗོད་པར་འགྱུར་ཏེ།
en: They will all attain buddhahood in buddha realms in the ten directions as numerous as the number of particles in a buddha realm, after as many innumerable eons have passed as there are particles in a buddha field, and they will turn the wheel of the Dharma and speak their praise of you.

source: རྒྱུ་གསུམ་པོ་དེས་ན་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལེགས་སོ་ཞེས་ཀྱང་སྨྲོས་ཤིག །
en: Therefore, it is for those three reasons, worthy being, that we should say, “Well done!” ’ “

source: ཡང་དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་མང་པོ་དག་གིས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། དེ་བཞིན་གཤེགས་པས་གང་ལ་ཡན་ལག་གསུམ་གྱིས་ལེགས་སོ་ཞེས་བགྱི་བ་སྤྲིང་ཞིང་།
en: At that time many tens of millions of bodhisattvas said in one voice, ‘Bhadanta Bhagavat, we also will go to the buddha realm Saṃtīraṇa in order to pay homage to and honor the tathāgata arhat samyaksam­buddha Ratnagarbha, and to see and praise that worthy being, the one to whom the Tathāgata sends a message of threefold congratulations and gives the flowers that are as stainless as the moon’s radiance.’ “

source: མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་བསྐུར་བའི་སྐྱེས་བུ་དམ་པ་དེ་ཡང་བལྟ་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་དེར་མཆི་ལགས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་ཁྱེད་ཅག་དེང་ལ་དེར་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པའི་སྤྱོད་པ་འཇིགས་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་ཉོན་ཅིག །
en: Noble son, the Tathāgata Prasphulitakusuma­vairocana said, ‘Noble sons, knowing that the time has come, you should go there and receive from the Tathāgata Ratnagarbha the Dharma discourse on the fearless conduct that reveals the entrance to samādhi.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རང་གིས་རྣམ་པར་འབྱེད་པས་ཡུལ་ཡང་དག་པར་འཁྲུགས་པ་དང་། གཟུངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་དགའ་བ་རྣམ་པར་འཁྲུགས་པ་ཞེས་བྱ་བ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་དེ་ལས་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དག་བླངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་མང་པོ་དང་ལྷན་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ནས་འཕགས་ཏེ་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་དུ་ལྷགས་ཏེ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེར་དོང་ངོ་།
en: Noble son, then the bodhisattvas Svaviṣayasaṃkopitaviṣaya and Dhāraṇī­saṃpraharṣaṇa­vikopita received from the Tathāgata Prasphulitakusuma­vairocana the flowers that are as stainless as the moon’s radiance, and together with many tens of millions of bodhisattvas they were dispatched from the buddha realm Saṃkusumitā, and in an instant they came and arrived at this buddha realm’s Jambūvana Park and went to where the Tathāgata Ratnagarbha was. “

source: །ཡང་དེའི་ཚེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་ཐེག་པ་ཆེན་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དག་དང་། ལྷ་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བར་དག་གིས་འདི་ལྟར་ཡོངས་སུ་གང་བར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན། བུ་རམ་ཤིང་གི་ཚལ་ལམ།
en: At that time, the entire buddha realm Saṃtīraṇa became filled with noble sons who were bodhisattvas of the Mahāyāna, followers of the Pratyekabuddhayāna, followers of the Śrāvakayāna, devas, and so on, up to and including mahoragas.

source: འདམ་བུའི་ཚལ་ལམ། ཏིལ་གྱི་ཞིང་ངམ། འབྲས་ཀྱི་ཞིང་རྒྱས་པས་ཀུན་ཏུ་ཁྱབ་པར་གྱུར་པ་དེ་བཞིན་དུ། དེའི་ཚེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་ཀྱང་ཐེག་པ་ཆེན་པོའི་རིགས་ཀྱི་བུ་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བར་དག་གིས་ཡོངས་སུ་གང་ཞིང་ཁྱབ་པར་གྱུར་ཏོ།
en: Just as a thicket of sugarcane, or a thicket of reeds, or a field of sesame plants, or a field of rice is completely filled, in that same way the buddha realm Saṃtīraṇa was at that time filled by noble sons of the Mahāyāna, and so on, up to and including mahoragas. “

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་མཆོད་པ་བྱས་ནས།
en: The bodhisattvas bowed their heads down to the feet of the Tathāgata Ratnagarbha, and they made offerings to him through the power of various samādhis and the miraculous powers of a bodhisattva.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔ་ན་བྲམ་ཟེ་ལ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་རྣམས་ཐལ་མོ་སྦྱར་ཏེ་བསྔགས་པ་བརྗོད་ཅིང་འཁོད་པ་མཐོང་བ་དང་།
en: Then they saw the entire assembly, with palms placed together, praising the brahmin who was in the presence of the Tathāgata Ratnagarbha.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་ཀྱིས་གང་ལ་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་དག་བསྐུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ནི་འདི་ཡིན་པ་ལྟ་སྙམ་ནས།
en: The bodhisattvas thought, ‘This must be the bodhisattva mahāsattva Mahākāruṇika to whom the Tathāgata Prasphulitakusuma­vairocana has sent these flowers, which are as stainless as the moon’s radiance.’ “

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་ཕྱིར་ཕྱོགས་ཏེ། བྲམ་ཟེ་དེ་ལ་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དེ་དག་ཕུལ་ནས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་རབ་རྒྱས་ཀྱིས་ཁྱོད་ལ་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་འདི་བསྐུར་ཞིང་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་ཡང་བྱིན་ཏེ།
en: The bodhisattvas turned from the Bhagavat, offered the flowers that are as stainless as the moon’s radiance to the brahmin, and said, ‘Worthy being, the Tathāgata Prasphulitakusuma­vairocana has sent you these flowers, which are as stainless as the moon’s radiance, and, worthy being, he conveys his congratulations!’

source: ཡན་ལག་གསུམ་གྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བརྗོད་པའི་བར་དུ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་ནོ།
en: And they continued as previously described in conveying the threefold congratulations. “

source: །མེ་ཏོག་གང་ཡིན་པ་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དག་ཏུ་ཆར་བཞིན་དུ་རབ་ཏུ་འབབ་པ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་དགེ་བའི་སྒྲ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་ཀྱང་ཀུན་གྱིས་གང་བར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། སྣང་བའི་སྒྲ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲ་དང་། སྟོབས་ཀྱི་སྒྲ་དང་། མི་འཇིགས་པའི་སྒྲ་དང་། མངོན་པར་ཤེས་པའི་སྒྲ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་སྒྲ་དང་། སྐྱེ་བ་མེད་པའི་སྒྲ་དང་། འགག་པ་མེད་པའི་སྒྲ་དང་། ཞི་བའི་སྒྲ་དང་། ཉེ་བར་ཞི་བའི་སྒྲ་དང་། རབ་ཏུ་ཞི་བའི་སྒྲ་དང་། བྱམས་པ་ཆེན་པོའི་སྒྲ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྒྲ་དང་། མི་སྐྱེ་བའི་ཆོས་ཀྱི་སྒྲ་དང་།
en: And those flowers that rained down in buddha realms that were empty filled those buddha realms with various good words: the word Buddha, the word Dharma, the word Saṅgha, the word light, the word perfection, the word strength, the word confidence, the word clairvoyance, the word uncontrived, the word nonorigination, the word noncessation, the word calmed, the word pacified, the word stilled, the words great kindness, the words great compassion, the words dharmas are without arising, the words the attainment of the level of consecration, and the words a talk on the Mahāyāna. “

source: དབང་བསྐུར་བའི་ས་ཐོབ་པའི་སྒྲ་དང་། ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་གི་སྒྲ་སྟེ། མེ་ཏོག་གི་ཆར་ཆེན་པོ་དེ་དག་གིས་དགེ་བའི་སྒྲ་དེ་ལྟ་བུས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་བཀང་སྟེ་གནས་སོ།
en: Those words from that great rainfall of flowers entirely filled those buddha realms.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྫུ་འཕྲུལ་ཆེ་བ། མཐུ་ཆེ་བ། ཆོས་ཟབ་མོ་ལ་དབང་ཐོབ་པ། གང་དག་འདུལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དེ་དག་ཏུ་ལྷགས་པ་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། སྨོན་ལམ་གྱི་དབང་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས།
en: There were bodhisattva mahāsattvas with great miraculous powers, great might, and the power of profound dharmas who, through the power of prayer, had gone to those empty buddha realms in order to ripen completely the beings there who were to be trained.

source: དེ་དག་དེ་ནས་རྫུ་འཕྲུལ་གྱིས་འདི་ལྟར་མགྱོགས་པར་དོང་སྟེ། འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་སྟོབས་དང་ལྡན་པ་ལག་པ་བརྐྱང་བ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དེ་དག་ནས་དོང་སྟེ།
en: On hearing those words, through the might of the Buddha, the power of prayer, and the strength of samādhi, those bodhisattvas with miraculous speed, as fast as a strong man extends his arm, left those empty buddha realms and came to the Saṃtīraṇa buddha realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་འདིར་ལྷགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་མཆོད་པ་བྱས་ཤིང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་ཡང་མཆོད་པ་བྱས་ནས་ཆོས་ཉན་པའི་ཕྱིར་གནས་ཇི་ལྟ་བུ་ཐོབ་པར་འཁོད་དོ།
en: Those bodhisattvas made offerings through various bodhisattva miracles to the Tathāgata Ratnagarbha and to the entire assembly. Then, in order to listen to the Dharma, they sat wherever they could. “

source: །རིགས་ཀྱི་བུ་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དེ་ལ་མེ་ཏོག་ཟླ་བ་མདོག་མཛེས་དྲི་མ་མེད་པ་དེ་དག་གིས་མཆོད་པ་བྱས་ཏེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: Noble son, the brahmin Samudrareṇu, the principal royal priest, offered the flowers that are as stainless as the moon’s radiance to the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, I request that you give me the prophecy of my highest, most complete enlightenment.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ཏིང་ངེ་འཛིན་གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: Noble son, the Tathāgata Ratnagarbha then entered the samādhi called the lamp of lightning.

source: ཏིང་ངེ་འཛིན་དེས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་གནས་པར་གྱུར་ནས་རི་དང་།
en: Through that samādhi the entirety of the buddha realm Saṃtīraṇa was transformed into the seven jewels.

source: ཤིང་ལྗོན་པ་རྣམས་དང་། རྩྭ་དང་། ཤིང་དང་། ས་གཞི་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་ཀུན་ཏུ་སྣང་ངོ་།
en: The mountains, trees, grass, wood, and entire ground appeared to be made of the seven jewels. “

source: །སེམས་ཅན་གང་དག་ཆོས་མཉན་པའི་ཕྱིར་དེ་ན་འཁོད་པ་དེ་དག་ཀྱང་དགེ་བའི་ཕྱོགས་ཇི་ལྟ་བུ་ཡིད་ལ་བྱེད་པ་དེ་ལྟ་བུའི་ལུས་སུ་ཁ་ཅིག་ནི་སེར་པོ། ཁ་ཅིག་ནི་དཀར་པོ། ཁ་ཅིག་ནི་བཙོད་ཁ། ཁ་ཅིག་ནི་དམར་པོ། ཁ་ཅིག་ནི་ནག་པོ། ཁ་ཅིག་ནི་སྐྱ་བོར་གནས་ཏེ།
en: All the beings who were gathered there transformed according to the aspect of virtue their minds were engaged in: the bodies of some became yellow, some became white, some became crimson, some became red, some became black, and some became gray.

source: ཁ་ཅིག་གི་ནི་ལུས་ནི་རླུང་ལྟ་བུར་ཀུན་ཏུ་སྣང་། ཁ་ཅིག་ནི་མེ་ལྟ་བུར། ཁ་ཅིག་ནི་ནམ་མཁའ་ལྟ་བུར། ཁ་ཅིག་ནི་སྨིག་རྒྱུ་ལྟ་བུར། ཁ་ཅིག་ནི་ཆུ་ལྟ་བུར། ཁ་ཅིག་ནི་རི་ལྟ་བུར། ཁ་ཅིག་ནི་ཚངས་པ་ལྟ་བུར། ཁ་ཅིག་ནི་བརྒྱ་བྱིན་ལྟ་བུར།
en: The bodies of some appeared to be made of air, some of fire, and some of space.

source: ཁ་ཅིག་ནི་མེ་ཏོག་ལྟ་བུར། ཁ་ཅིག་ནི་ནམ་མཁའ་ལྡིང་ལྟ་བུར། ཁ་ཅིག་ནི་སེང་གེ་ལྟ་བུར། ཁ་ཅིག་ནི་ཉི་མ་ལྟ་བུར། ཁ་ཅིག་ནི་ཟླ་བ་ལྟ་བུར།
en: Some appeared to be mirages; some appeared to be made of water; some appeared to be mountains; some appeared to be Brahmās; some appeared to be Śakras; some appeared to be flowers; some appeared to be garuḍas; some appeared to be lions; some appeared to be suns; some appeared to be moons; some appeared to be stars; some appeared to be vultures; and some appeared to have the bodies of jackals.

source: ཁ་ཅིག་ནི་སྐར་མ་ལྟ་བུར། ཁ་ཅིག་ནི་བྱ་རྒོད་ལྟ་བུ་དང་། ཁ་ཅིག་ནི་ཝ་ལྟ་བུ་དག་ཏུ་ཀུན་ཏུ་སྣང་སྟེ། ཆོས་མཉན་པའི་ཕྱིར་དེ་ན་འཁོད་པའི་སེམས་ཅན་དེ་དག་དགེ་བའི་ཕྱོགས་ཇི་ལྟ་བུ་ཡིད་ལ་བྱེད་པ་དེ་ལྟ་བུའི་ལུས་སུ་ཀུན་ཏུ་སྣང་ངོ་། །རིགས་ཀྱི་བུ་དེ་ན་སེམས་ཅན་གང་དག་གིས་རང་རང་གི་ལུས་ཇི་ལྟ་བུར་མཐོང་བ་དེ་ལྟ་བུར་སེམས་ཅན་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྐུ་ཡང་མཐོང་ངོ་།
en: Those beings all appeared in the form of the aspect of virtue in which their minds were engaged as they sat there to listen to the Dharma, and, noble son, those beings perceived the body of the Tathāgata Ratnagarbha to be the same as they perceived their own to be. “

source: །རིགས་ཀྱི་བུ་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེས་ཀྱང་མདུན་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་པད་མ་འདབ་མ་སྟོང་དང་ལྡན་པའི་ཟེ་བ་ལ་བཞུགས་པར་མཐོང་ངོ་།
en: Noble son, the brahmin Samudrareṇu, the principal royal priest, saw before him the Tathāgata Ratnagarbha seated on the pericarp of a thousand-petaled lotus made of the seven jewels.

source: །རིགས་ཀྱི་བུ་དེ་ན་སེམས་ཅན་གང་དག་ས་དང་ནམ་མཁའ་ལ་འདུག་པའམ། འགྲེང་བའི་སེམས་ཅན་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྐུ་ཡང་དེ་ལྟར་མཐོང་སྟེ།
en: Noble son, all those beings who were seated, who were standing, who were on the ground, or who were in the air, each saw the Tathāgata Ratnagarbha in their own way.

source: བདག་ནི་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔ་ན་འདུག་སྟེ། ཐུགས་ཐམས་ཅད་ཀྱིས་དགོངས་ཤིང་བདག་གཅིག་པུ་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ་སྙམ་མོ།
en: They thought, ‘I am seated right in front of the Tathāgata Ratnagarbha, whose mind knows everything, and he is teaching the Dharma to me alone.’ “
